_site/bookmarks/app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks"

  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save
---
INSERT INTO "bookmarks" ("created_at", "name", "notes", "updated_at", "url") VALUES (?, ?, ?, ?, ?)

    def set_bookmark
      @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "1"]]